# -*- coding: utf-8 -*-
import stanza
nlp = stanza.Pipeline("my", processors="tokenize,ner", use_gpu=False, verbose=False)
text = """စစ်ကော်မရှင် ရွေးကောက်ပွဲပြုလုပ်မည့် ချင်းပြည်နယ်၊ တီးတိန်မြို့အဝင်တွင်ရှိသော စစ်တပ်ဂိတ်စခန်းကို နိုဝင်ဘာလ ၂၆ ရက်နေ့တွင် စီးနင်းတိုက်ခိုက်ရာ စစ်သုံ့ပန်းများနှင့် လက်နက်ခဲယမ်းများ သိမ်းဆည်း ရမိခဲ့ကြောင်း ချင်းညီနောင်တပ်ဖွဲ့ (CB) ထံက သိရသည်။ 

တီးတိန်မြို့အဝင်အထွက်ကို ထိန်းချုပ်ရန်ကြိုးပမ်းနေသည့်အတွက် တီးတိန်မြို့အဝင် ဆိုင်းဘုတ်အနီးရှိ စစ်တပ်စခန်းကို တိုက်ခိုက်သိမ်းပိုက်ခဲ့ခြင်းဖြစ်ကြောင်း ချင်းညီနောင်တပ်ဖွဲ့ဝင်ဖြစ်သည့် PDF Zoland က ယနေ့ ထုတ်ပြန်သည်။ 

အင်အား ၆၀ နီးပါးဖြင့် တပ်စွဲထားသည့် ထိုဂိတ်စခန်းကို  နံနက် ၈ နာရီ ဝန်းကျင်တွင် စတင်တိုက်ခိုက်ခဲ့ပြီး တော်လှန်ရေးအင်အားစုများဘက်မှ အထိအခိုက်မရှိဘဲ ပြန်လည်ထိန်းချုပ်နိုင်ခဲ့ကြောင်း PDF Zoland က ဆိုသည်။ 

စစ်သုံ့ပန်း နှစ်ဦး၊ လက်နက် သုံးလက်နှင့် ခဲယမ်းအများပြား သိမ်းဆည်းရမိကြောင်း PDF Zoland က ဓာတ်ပုံများနှင့်တကွ ထုတ်ပြန်ထားသည်။ 

“RPG ဗုံးသီးအပါအဝင် လက်နက်ခဲယမ်းသိမ်းဆည်းရမိ၊ စစ်သုံ့ပန်းဖမ်းဆီးရမိတာလည်းရှိပါတယ်။ စစ် သုံ့ပန်းတွေကို သက်ဆိုင်ရာဌာနကို လွှဲပြောင်းပြီးထိန်းသိမ်းမယ်။ စစ်ဆေးမေးမြန်းမှုနဲ့ အရေးယူဆောင်ရွက်မှု ဆက်လက်လုပ်ဆောင်ဖို့ရှိပါတယ်”ဟု PDF Zoland မှ တာဝန်ရှိသူတစ်ဦးက ပြောသည်။ 

တိုက်ပွဲအတွင်း စစ်ကော်မရှင်တပ်ဘက်မှ ထိခိုက်သေဆုံးမှုရှိပြီး အရေအတွက်အတိအကျမပြောနိုင်ကြောင်း PDF Zoland တာဝန်ရှိသူကပြောသည်။ 


ချင်းပြည်နယ်မြို့နယ် ကိုးခုအနက် နယ်မြေထက်ဝက်ကျော်ကို လက်လွှတ်ထားရသည့် စစ်တပ်သည် အောက်တိုဘာလကုန်ပိုင်းကစပြီး ချင်းပြည်နယ်မြောက်ပိုင်းကို နယ်မြေစိုးမိုးမှုပြန်ရရန်အင်အား အလုံးအရင်းဖြင့်ထိုးစစ်ဆင်နေသည်။ 

တီးတိန်မြို့မှထွက်လာသည့် စစ်ကြောင်း၊ ကလေးမြို့နယ်မှ ကလေး – တီးတိန်လမ်းအတိုင်း သိုင်းငင်း ရွာဘက် သို့တက်လာသည့် စစ်ကြောင်းနှင့် ကလေးမြို့နယ်တောင်ပိုင်း ကလေး – ဂန့်ဂေါ လမ်းမှတဆင့် တက်လာသည့် စစ်ကြောင်း စုစုပေါင်း စစ်ကြောင်း သုံးခုဖြန့်ခွဲကာ စီးနင်းနေခြင်းဖြစ်သည်။ 

တီးတိန်မြို့ အခြေစိုက် အမှတ် (၂၆၉) ခြေလျင်တပ်ရင်းကို အောက်တိုဘာလကုန်ပိုင်းတွင် ရဟတ်ယာဉ် ၂၆ ခေါက်ဖြင့် အင်အား ၅၀၀ နီးပါးဖြည့်တင်းခဲ့ပြီး ရက်ပိုင်းအတွင်းမှာပင် တီးတိန်မြို့နယ်ထဲကို ထိုးစစ်ဆင်ခဲ့သည်။ 

အင်အားအလုံးအရင်းဖြင့် စစ်ကြောင်းထိုးလာသဖြင့် ကလေး – တီးတိန်လမ်းပေါ်ရှိ ကနေဒီတောင်နှင့် သိုင်းငင်းရွာ အခြေစိုက်စခန်းကို နိုဝင်ဘာလဆန်းတွင် တော်လှန်ရေးအင်အားစုများက လက်လွှတ်ခဲ့ရသည်။ သို့သော်လည်း စစ်တပ် ပြန်ရယူသွားသည့် ကနေဒီတောင်စခန်းကို နှစ်ပတ်အကြာ နိုဝင်ဘာလ ဒုတိယပတ်တွင် PDF Zoland က ပြန်လည်ထိန်းချုပ်နိုင်ခဲ့သည်။ 

တီးတိန်မြို့မှ ထွက်လာသည့် ထိုစစ်ကြောင်းနှင့် အောက်တိုဘာလကုန်ပိုင်းက စစ်ကိုင်းတိုင်း၊ ကလေးမြို့မှ ထွက်လာသည့် စစ်ကြောင်းသည် သိုင်းငင်းတွင် ပေါင်းဆုံသွားပြီးနောက် ဖလမ်းမြို့ဘက်သို့ ဦးတည်ကာ ဆက်လက်စစ်ကြောင်းထိုးနေကြောင်း ချင်းဒေသတော်လှန်ရေးအဖွဲ့တစ်ခုဖြစ်သည့် CDF CDM (Civi Defense Militia) Siyin စီးယင်းအဖွဲ့ထံက သိရသည်။ 

နိုဝင်ဘာလ ၂၆ ရက်နေ့ တီးတိန်မြို့နယ်၊ ဇောင်ကောင်ကျေးရွာအနီးတွင် တိုက်ပွဲဖြစ်ခဲ့ရာ လေကြောင်းမှ ပစ်ခတ် တိုက်ခိုက်မှုများရှိခဲ့ပြီး ကလေးမြို့နယ်ဘက်မှလည်း လက်နက်ကြီးဖြင့် ပစ်ခတ်ခဲ့ကြောင်း CDM Siyin အဖွဲ့ ပြောရေးဆိုခွင့်ရှိသူက ပြောသည်။


ကလေး – ဂန့်ဂေါလမ်းမှတက်လာသည့် အင်အားရာနှင့်ချီပါဝင်သည့် စစ်ကြောင်းသည် ချင်းနှင့်စစ်ကိုင်း နယ်စပ်ရှိ ဝေဘူလမြို့ကို နိုဝင်ဘာလ လဆန်းတွင် ပြန်လည်ထိန်းချုပ်ပြီးနောက် ဖလမ်းမြို့ဘက်သို့ ဆက်လက် စစ်ကြောင်းထိုးလာရာ မြို့အရှေ့ဘက် ၁၂ မိုင်ခန့်အကွာ မဏိပူရ်မြစ်အနီး ကျေးရွာများတွင် ခြေကုပ်ယူထားပြီး မြို့ကိုပြန်ရရန် ထိုးစစ်ဆင်နေသည်။ 

ရှမ်းပြည်နယ်မြောက်ပိုင်းတွင် တရုတ်ကြားဝင်စေ့စပ်မှုဖြင့် ကိုးကန့်တပ်၊ တအာင်းတပ်တို့နှင့် အပစ်ရပ်ပြီးနောက် စစ်တပ်သည် နိုင်ငံအလယ်ပိုင်း စစ်ကိုင်းတိုင်း၊ မန္တလေးတိုင်း၊ မကွေးတိုင်းနှင့် ချင်းပြည်နယ်ကို အင်အား အလုံးအရင်းဖြင့် စစ်ကြောင်းထိုးပြီး နယ်မြေပြန်လည်ထိန်းချုပ်စိုးမိုးနိုင်ရန် ကြိုးပမ်းနေသည်။ 
"""
doc = nlp(text)
print([(e.text, e.type) for e in doc.ents])
